# DocumentClosed Event (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..DocumentClosed Event
Application Class See Also
---
Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public event EventHandler<DocumentClosedEventArgs> DocumentClosed
```

Visual Basic
---
```text
Public Event DocumentClosed As EventHandler(Of DocumentClosedEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<DocumentClosedEventArgs^>^ DocumentClosed {
	void add (EventHandler<DocumentClosedEventArgs^>^ value);
	void remove (EventHandler<DocumentClosedEventArgs^>^ value);
}
```

# Remarks
This event is raised immediately after Revit has finished closing a document. It is raised even when document closing failed or was cancelled (during DocumentClosing event).
This event is not cancellable, for the process of closing document has already been finished.
The document cannot be modified because the corresponding object does not exist anymore.
# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace